Австралия/src/Enums/OperationTypesSupplierInvoice/OperationTypesSupplierInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesSupplierInvoice</name>
  <enumValues>
    <name>Invoice</name>
  </enumValues>
  <enumValues>
    <name>AdvanceInvoice</name>
  </enumValues>
  <enumValues>
    <name>ZeroInvoice</name>
  </enumValues>
  <enumValues>
    <name>DropShipping</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/OperationTypesSalesInvoice/OperationTypesSalesInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesSalesInvoice</name>
  <enumValues>
    <name>Invoice</name>
  </enumValues>
  <enumValues>
    <name>AdvanceInvoice</name>
  </enumValues>
  <enumValues>
    <name>ZeroInvoice</name>
  </enumValues>
  <enumValues>
    <name>ClosingInvoice</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/OperationTypesGoodsIssue/OperationTypesGoodsIssue.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesGoodsIssue</name>
  <enumValues>
    <name>SaleToCustomer</name>
  </enumValues>
  <enumValues>
    <name>TransferToAThirdParty</name>
  </enumValues>
  <enumValues>
    <name>ReturnToAThirdParty</name>
  </enumValues>
  <enumValues>
    <name>PurchaseReturn</name>
  </enumValues>
  <enumValues>
    <name>IntraCommunityTransfer</name>
  </enumValues>
  <enumValues>
    <name>TransferToSubcontractor</name>
  </enumValues>
  <enumValues>
    <name>TransferToSubcontractingCustomer</name>
  </enumValues>
  <enumValues>
    <name>ReturnToSubcontractingCustomer</name>
  </enumValues>
  <enumValues>
    <name>DropShipping</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/OperationTypesGoodsReceipt/OperationTypesGoodsReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesGoodsReceipt</name>
  <enumValues>
    <name>PurchaseFromSupplier</name>
  </enumValues>
  <enumValues>
    <name>ReceiptFromAThirdParty</name>
  </enumValues>
  <enumValues>
    <name>ReturnFromAThirdParty</name>
  </enumValues>
  <enumValues>
    <name>SalesReturn</name>
  </enumValues>
  <enumValues>
    <name>IntraCommunityTransfer</name>
  </enumValues>
  <enumValues>
    <name>ReceiptFromSubcontractor</name>
  </enumValues>
  <enumValues>
    <name>ReturnFromSubcontractor</name>
  </enumValues>
  <enumValues>
    <name>ReceiptFromSubcontractingCustomer</name>
  </enumValues>
  <enumValues>
    <name>DropShipping</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/TaxInvoiceIssued/TaxInvoiceIssued.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TaxInvoiceIssued</name>
  <basedOn>Document.SalesInvoice</basedOn>
  <basedOn>Document.CreditNote</basedOn>
  <basedOn>Document.SubcontractorInvoiceIssued</basedOn>
  <registerRecords>AccumulationRegister.VATOutput</registerRecords>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfSupply</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesTaxInvoiceIssued</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentSubtotal</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentTax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>BasisDocuments</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BasisDocument</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.CreditNote</types>
        <types>DocumentRef.SubcontractorInvoiceIssued</types>
        <types>DocumentRef.OnlineReceipt</types>
        <types>DocumentRef.PaymentReceipt</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/TaxInvoiceReceived/TaxInvoiceReceived.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TaxInvoiceReceived</name>
  <basedOn>Document.SupplierInvoice</basedOn>
  <basedOn>Document.DebitNote</basedOn>
  <basedOn>Document.AdditionalExpenses</basedOn>
  <basedOn>Document.SubcontractorInvoiceReceived</basedOn>
  <basedOn>Document.ExpenseReport</basedOn>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.VATIncurred</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.VATInput</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfSupply</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesTaxInvoiceReceived</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalDocumentNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentSubtotal</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentTax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>BasisDocuments</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BasisDocument</name>
      <type>
        <types>DocumentRef.SupplierInvoice</types>
        <types>DocumentRef.SubcontractorInvoiceReceived</types>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.DebitNote</types>
        <types>DocumentRef.ExpenseReport</types>
        <types>DocumentRef.CashVoucher</types>
        <types>DocumentRef.AdditionalExpenses</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/CommonModules/DriveServerCall/Module.bsl
#Region Public

// The procedure defines the following: if when editing
// a document date, the document numbering period changes,
// the document is assigned a new unique number.
//
// Parameters:
//  DocumentRef - ref to a document from
// which procedure DocumentNewDate is called - new date of
// the DocumentInitialDate document - initial document date 
//
// Returns:
//  Number - dates difference.
//
Function CheckDocumentNumber(DocumentRef, NewDocumentDate, InitialDateOfDocument) Export
	
	DocMetadata = DocumentRef.Metadata();
	
	If DocMetadata.Numerator = Metadata.DocumentNumerators.CustomizableNumbering Then
		
		Return Numbering.GetDateDiff(DocumentRef, NewDocumentDate, InitialDateOfDocument);
		
	Else
		
		// Define number change periodicity assigned for the current documents kind
		NumberChangePeriod = DocumentRef.Metadata().NumberPeriodicity;
		
		// Depending on the set numbers change
		// periodicity define the difference of an old and a new document version dates.
		If NumberChangePeriod = Metadata.ObjectProperties.DocumentNumberPeriodicity.Year Then
			DateDiff = BegOfYear(InitialDateOfDocument) - BegOfYear(NewDocumentDate);
		ElsIf NumberChangePeriod = Metadata.ObjectProperties.DocumentNumberPeriodicity.Quarter Then
			DateDiff = BegOfQuarter(InitialDateOfDocument) - BegOfQuarter(NewDocumentDate);
		ElsIf NumberChangePeriod = Metadata.ObjectProperties.DocumentNumberPeriodicity.Month Then
			DateDiff = BegOfMonth(InitialDateOfDocument) - BegOfMonth(NewDocumentDate);
		ElsIf NumberChangePeriod = Metadata.ObjectProperties.DocumentNumberPeriodicity.Day Then
			DateDiff = InitialDateOfDocument - NewDocumentDate;
		Else
			Return 0;
		EndIf;
		
	EndIf;
	
	Return DateDiff;
	
EndFunction

Function AdvanceInvoicing(DocumentRef) Export
	
	Result = False;
	
	If ValueIsFilled(DocumentRef)
		And (TypeOf(DocumentRef) = Type("DocumentRef.SupplierInvoice")
		Or TypeOf(DocumentRef) = Type("DocumentRef.SalesInvoice")) Then
		
		EnumOperationKind = Common.ObjectAttributeValue(DocumentRef, "OperationKind");
		
		If TypeOf(DocumentRef) = Type("DocumentRef.SupplierInvoice") Then
			
			Result = (EnumOperationKind = Enums.OperationTypesSupplierInvoice.AdvanceInvoice);
			
		ElsIf TypeOf(DocumentRef) = Type("DocumentRef.SalesInvoice") Then
			
			Result = (EnumOperationKind = Enums.OperationTypesSalesInvoice.AdvanceInvoice);
			
		EndIf;
		
	EndIf;
	
	Return Result;
	
EndFunction

// Write the application logout confirmation
// setting for the current user.
// 
// Parameters:
//   Value - Boolean   - setting value.
// 
Procedure SaveExitConfirmationSettings(Value) Export
	
	Common.CommonSettingsStorageSave("UserCommonSettings", "AskConfirmationOnExit", Value);
	
EndProcedure

Function GetCostAmount(StructureData) Export
	
	Return DriveServer.GetCostAmount(StructureData);
	
EndFunction

Function ObjectAttributeValue(Ref, AttributeName, SelectAllowedItems = False) Export
	
	Return Common.ObjectAttributeValue(Ref, AttributeName, SelectAllowedItems);
	
EndFunction

Function GetFunctionalOptionValue(Name) Export
	
	Return GetFunctionalOption(Name);
	
EndFunction

Function EventGetOperationKindMapToForms() Export
	
	Return Documents.Event.GetOperationKindMapToForms();
	
EndFunction

Function AdvancedContactInformationInputContactInformationInputFormName(InformationKind) Export
	
	Return DataProcessors.AdvancedContactInformationInput.ContactInformationInputFormName(InformationKind);
	
EndFunction

Function GetConstant(ConstantName) Export
	
	Constant = Constants[ConstantName].Get();
	Return Constant;
	
EndFunction

Procedure SetConstant(ConstantName, Value) Export
	
	Constants[ConstantName].Set(Value);
	
EndProcedure

Function GetCurrencyRateChoiceList(Currency, PresentationCurrency, DocumentDate, Company) Export
	
	Return DriveServer.GetCurrencyRateChoiceList(Currency, PresentationCurrency, DocumentDate, Company);
	
EndFunction

#Region TaxInvoices

Function TaxInvoiceIssuedGetTitle(OperationKind) Export
	
	Return Documents.TaxInvoiceIssued.GetTitle(OperationKind);
	
EndFunction

Function TaxInvoiceReceivedGetTitle(OperationKind) Export
	
	Return Documents.TaxInvoiceReceived.GetTitle(OperationKind);
	
EndFunction

#EndRegion

// begin Drive.FullVersion

#Region Subcontractors

Function GetNotificationEventName(Ref) Export
	
	If Ref.OperationType = Enums.OperationTypesGoodsIssue.TransferToSubcontractor 
		Or Ref.OperationType = Enums.OperationTypesGoodsReceipt.ReceiptFromSubcontractor
		Or Ref.OperationType = Enums.OperationTypesGoodsReceipt.ReturnFromSubcontractor Then
		
		Return "NotificationSubcontractDocumentsChange";
		
	ElsIf Ref.OperationType = Enums.OperationTypesGoodsReceipt.ReceiptFromSubcontractingCustomer 
		Or Ref.OperationType = Enums.OperationTypesGoodsIssue.ReturnToSubcontractingCustomer
		Or Ref.OperationType = Enums.OperationTypesGoodsIssue.TransferToSubcontractingCustomer Then
		
		Return "NotificationSubcontractingServicesDocumentsChange";
		
	Else
		Return "";
	EndIf;
	
EndFunction

#EndRegion

// end Drive.FullVersion 

#Region DesktopManagement

// Determines a default desktop depending on the user access rights.
//
Procedure ConfigureUserDesktop(SettingsModified = False) Export
	
	HomePageSettings = Common.SystemSettingsStorageLoad("Common/HomePageSettings","");
	
	If HomePageSettings = Undefined Then
		
		HomePageSettings = New HomePageSettings;
		FormsContent = HomePageSettings.GetForms();
		
		If IsInRole("FullRights") Then
			
			FoundItem = FormsContent.LeftColumn.Find("CommonForm.GettingStarted");
			If FoundItem = Undefined
				OR Not (Constants.CompanyInformationIsFilled.Get()
					AND Constants.OpeningBalanceIsFilled.Get()) Then
				Return;
			EndIf;
			
			FormsContent.LeftColumn.Delete(FoundItem);
			FormsContent.LeftColumn.Add("DataProcessor.QuickActions.Form.QuickActions");
			FormsContent.LeftColumn.Add("DataProcessor.BusinessPulse.Form.BusinessPulse");
			FormsContent.RightColumn.Add("CommonForms.ToDoList");
		ElsIf IsInRole("UseAnalysisReports") Then
			FormsContent.LeftColumn.Add("DataProcessor.QuickActions.Form.QuickActions");
			FormsContent.LeftColumn.Add("DataProcessor.BusinessPulse.Form.BusinessPulse");
		ElsIf IsInRole("AddEditSalesSubsystem") Then
			FormsContent.LeftColumn.Add("DocumentJournal.SalesDocuments.ListForm");
		ElsIf IsInRole("AddEditPurchasesSubsystem") Then
			FormsContent.LeftColumn.Add("DocumentJournal.PurchaseDocuments.ListForm");
		ElsIf IsInRole("AddEditProductionSubsystem") Then
			FormsContent.LeftColumn.Add("DocumentJournal.ProductionDocuments.ListForm");
		ElsIf IsInRole("AddEditPayrollSubsystem") Then
			FormsContent.LeftColumn.Add("DocumentJournal.PayrollDocuments.ListForm");
		ElsIf IsInRole("AddEditBankSubsystem") Then
			FormsContent.LeftColumn.Add("DocumentJournal.BankDocuments.ListForm");
		ElsIf IsInRole("BasicRightsDriveForExternalUsers") Then
			
			FormsContent.RightColumn.Clear();
			FormsContent.LeftColumn.Clear();
			
			FormsContent.LeftColumn.Add("DataProcessor.ExternalUsersDesktop.Form.BalanceForm");
			FormsContent.LeftColumn.Add("DataProcessor.ExternalUsersDesktop.Form.FinanceDataChartForm");
			
			FormsContent.RightColumn.Add("DataProcessor.ExternalUsersDesktop.Form.CompanyInfoForm");
			If GetFunctionalOption("UseSupportForExternalUsers") Then
				FormsContent.RightColumn.Add("BusinessProcess.Job.Form.ListForm");
			EndIf;
			
		EndIf;
		
		HomePageSettings.SetForms(FormsContent);
		Common.SystemSettingsStorageSave("Common/HomePageSettings","", HomePageSettings);
		
		SettingsModified = True;
		
	ElsIf IsInRole("BasicRightsDriveForExternalUsers") Then
		
		HomePageSettings = New HomePageSettings;
		FormsContent = HomePageSettings.GetForms();
		
		FormsContent.RightColumn.Clear();
		FormsContent.LeftColumn.Clear();
		
		FormsContent.LeftColumn.Add("DataProcessor.ExternalUsersDesktop.Form.BalanceForm");
		FormsContent.LeftColumn.Add("DataProcessor.ExternalUsersDesktop.Form.FinanceDataChartForm");
		
		FormsContent.RightColumn.Add("DataProcessor.ExternalUsersDesktop.Form.CompanyInfoForm");
		If GetFunctionalOption("UseSupportForExternalUsers") Then
			FormsContent.RightColumn.Add("BusinessProcess.Job.Form.ListForm");
		EndIf;
		
		HomePageSettings.SetForms(FormsContent);
		Common.SystemSettingsStorageSave("Common/HomePageSettings","", HomePageSettings);
		
		SettingsModified = True;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Print

Function MessageTemplateAboutUserTemplateUsed() Export
	
	If Not Users.IsFullUser() Then
		Return Undefined;
	EndIf;
	
	Table = New SpreadsheetDocument;
	
	Table.ShowGrid = False;
	Table.ShowHeaders = False;
	Table.PageOrientation = PageOrientation.Landscape;
	Table.FitToPage = True;
	Table.ReadOnly = True;
	
	Template = GetCommonTemplate("WarningAboutUserTemplateUsed");
	Table.Put(Template.GetArea("Header"));
	
	CommonSettingsStorage.Delete("UserTemplateUsed", "" , InfoBaseUsers.CurrentUser().Name);
	
	Return Table;
	
EndFunction

#EndRegion

#EndRegion
